STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233fxx_ca35.h
/*************  Bit definition for ETH_MMC_TX_INTERRUPT register  *************/
#define ETH_MMC_TX_INTERRUPT_TXGBOCTIS_Pos            (0U)
#define ETH_MMC_TX_INTERRUPT_TXGBOCTIS_Msk            (0x1UL << ETH_MMC_TX_INTERRUPT_TXGBOCTIS_Pos)                /*!< 0x00000001 */
#define ETH_MMC_TX_INTERRUPT_TXGBOCTIS                ETH_MMC_TX_INTERRUPT_TXGBOCTIS_Msk                         /*!< MMC Transmit Good Bad Octet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXGBPKTIS_Pos            (1U)
#define ETH_MMC_TX_INTERRUPT_TXGBPKTIS_Msk            (0x1UL << ETH_MMC_TX_INTERRUPT_TXGBPKTIS_Pos)                /*!< 0x00000002 */
#define ETH_MMC_TX_INTERRUPT_TXGBPKTIS                ETH_MMC_TX_INTERRUPT_TXGBPKTIS_Msk                         /*!< MMC Transmit Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXBCGPIS_Pos             (2U)
#define ETH_MMC_TX_INTERRUPT_TXBCGPIS_Msk             (0x1UL << ETH_MMC_TX_INTERRUPT_TXBCGPIS_Pos)                 /*!< 0x00000004 */
#define ETH_MMC_TX_INTERRUPT_TXBCGPIS                 ETH_MMC_TX_INTERRUPT_TXBCGPIS_Msk                          /*!< MMC Transmit Broadcast Good Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXMCGPIS_Pos             (3U)
#define ETH_MMC_TX_INTERRUPT_TXMCGPIS_Msk             (0x1UL << ETH_MMC_TX_INTERRUPT_TXMCGPIS_Pos)                 /*!< 0x00000008 */
#define ETH_MMC_TX_INTERRUPT_TXMCGPIS                 ETH_MMC_TX_INTERRUPT_TXMCGPIS_Msk                          /*!< MMC Transmit Multicast Good Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TX64OCTGBPIS_Pos         (4U)
#define ETH_MMC_TX_INTERRUPT_TX64OCTGBPIS_Msk         (0x1UL << ETH_MMC_TX_INTERRUPT_TX64OCTGBPIS_Pos)             /*!< 0x00000010 */
#define ETH_MMC_TX_INTERRUPT_TX64OCTGBPIS             ETH_MMC_TX_INTERRUPT_TX64OCTGBPIS_Msk                      /*!< MMC Transmit 64 Octet Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_Pos     (5U)
#define ETH_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_Msk     (0x1UL << ETH_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_Pos)         /*!< 0x00000020 */
#define ETH_MMC_TX_INTERRUPT_TX65T127OCTGBPIS         ETH_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_Msk                  /*!< MMC Transmit 65 to 127 Octet Good Bad Packet Counter */
#define ETH_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_Pos    (6U)
#define ETH_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_Msk    (0x1UL << ETH_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_Pos)        /*!< 0x00000040 */
#define ETH_MMC_TX_INTERRUPT_TX128T255OCTGBPIS        ETH_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_Msk                 /*!< MMC Transmit 128 to 255 Octet Good Bad Packet Counter */
#define ETH_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_Pos    (7U)
#define ETH_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_Msk    (0x1UL << ETH_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_Pos)        /*!< 0x00000080 */
#define ETH_MMC_TX_INTERRUPT_TX256T511OCTGBPIS        ETH_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_Msk                 /*!< MMC Transmit 256 to 511 Octet Good Bad Packet Counter */
#define ETH_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_Pos   (8U)
#define ETH_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_Msk   (0x1UL << ETH_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_Pos)       /*!< 0x00000100 */
#define ETH_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS       ETH_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_Msk                /*!< MMC Transmit 512 to 1023 Octet Good Bad Packet Counter */
#define ETH_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_Pos   (9U)
#define ETH_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_Msk   (0x1UL << ETH_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_Pos)       /*!< 0x00000200 */
#define ETH_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS       ETH_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_Msk                /*!< MMC Transmit 1024 to Maximum Octet Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXUCGBPIS_Pos            (10U)
#define ETH_MMC_TX_INTERRUPT_TXUCGBPIS_Msk            (0x1UL << ETH_MMC_TX_INTERRUPT_TXUCGBPIS_Pos)                /*!< 0x00000400 */
#define ETH_MMC_TX_INTERRUPT_TXUCGBPIS                ETH_MMC_TX_INTERRUPT_TXUCGBPIS_Msk                         /*!< MMC Transmit Unicast Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXMCGBPIS_Pos            (11U)
#define ETH_MMC_TX_INTERRUPT_TXMCGBPIS_Msk            (0x1UL << ETH_MMC_TX_INTERRUPT_TXMCGBPIS_Pos)                /*!< 0x00000800 */
#define ETH_MMC_TX_INTERRUPT_TXMCGBPIS                ETH_MMC_TX_INTERRUPT_TXMCGBPIS_Msk                         /*!< MMC Transmit Multicast Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXBCGBPIS_Pos            (12U)
#define ETH_MMC_TX_INTERRUPT_TXBCGBPIS_Msk            (0x1UL << ETH_MMC_TX_INTERRUPT_TXBCGBPIS_Pos)                /*!< 0x00001000 */
#define ETH_MMC_TX_INTERRUPT_TXBCGBPIS                ETH_MMC_TX_INTERRUPT_TXBCGBPIS_Msk                         /*!< MMC Transmit Broadcast Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXUFLOWERPIS_Pos         (13U)
#define ETH_MMC_TX_INTERRUPT_TXUFLOWERPIS_Msk         (0x1UL << ETH_MMC_TX_INTERRUPT_TXUFLOWERPIS_Pos)             /*!< 0x00002000 */
#define ETH_MMC_TX_INTERRUPT_TXUFLOWERPIS             ETH_MMC_TX_INTERRUPT_TXUFLOWERPIS_Msk                      /*!< MMC Transmit Underflow Error Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXSCOLGPIS_Pos           (14U)
#define ETH_MMC_TX_INTERRUPT_TXSCOLGPIS_Msk           (0x1UL << ETH_MMC_TX_INTERRUPT_TXSCOLGPIS_Pos)               /*!< 0x00004000 */
#define ETH_MMC_TX_INTERRUPT_TXSCOLGPIS               ETH_MMC_TX_INTERRUPT_TXSCOLGPIS_Msk                        /*!< MMC Transmit Single Collision Good Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXMCOLGPIS_Pos           (15U)
#define ETH_MMC_TX_INTERRUPT_TXMCOLGPIS_Msk           (0x1UL << ETH_MMC_TX_INTERRUPT_TXMCOLGPIS_Pos)               /*!< 0x00008000 */
#define ETH_MMC_TX_INTERRUPT_TXMCOLGPIS               ETH_MMC_TX_INTERRUPT_TXMCOLGPIS_Msk                        /*!< MMC Transmit Multiple Collision Good Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXDEFPIS_Pos             (16U)
#define ETH_MMC_TX_INTERRUPT_TXDEFPIS_Msk             (0x1UL << ETH_MMC_TX_INTERRUPT_TXDEFPIS_Pos)                 /*!< 0x00010000 */
#define ETH_MMC_TX_INTERRUPT_TXDEFPIS                 ETH_MMC_TX_INTERRUPT_TXDEFPIS_Msk                          /*!< MMC Transmit Deferred Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXLATCOLPIS_Pos          (17U)
#define ETH_MMC_TX_INTERRUPT_TXLATCOLPIS_Msk          (0x1UL << ETH_MMC_TX_INTERRUPT_TXLATCOLPIS_Pos)              /*!< 0x00020000 */
#define ETH_MMC_TX_INTERRUPT_TXLATCOLPIS              ETH_MMC_TX_INTERRUPT_TXLATCOLPIS_Msk                       /*!< MMC Transmit Late Collision Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXEXCOLPIS_Pos           (18U)
#define ETH_MMC_TX_INTERRUPT_TXEXCOLPIS_Msk           (0x1UL << ETH_MMC_TX_INTERRUPT_TXEXCOLPIS_Pos)               /*!< 0x00040000 */
#define ETH_MMC_TX_INTERRUPT_TXEXCOLPIS               ETH_MMC_TX_INTERRUPT_TXEXCOLPIS_Msk                        /*!< MMC Transmit Excessive Collision Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXCARERPIS_Pos           (19U)
#define ETH_MMC_TX_INTERRUPT_TXCARERPIS_Msk           (0x1UL << ETH_MMC_TX_INTERRUPT_TXCARERPIS_Pos)               /*!< 0x00080000 */
#define ETH_MMC_TX_INTERRUPT_TXCARERPIS               ETH_MMC_TX_INTERRUPT_TXCARERPIS_Msk                        /*!< MMC Transmit Carrier Error Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXGOCTIS_Pos             (20U)
#define ETH_MMC_TX_INTERRUPT_TXGOCTIS_Msk             (0x1UL << ETH_MMC_TX_INTERRUPT_TXGOCTIS_Pos)                 /*!< 0x00100000 */
#define ETH_MMC_TX_INTERRUPT_TXGOCTIS                 ETH_MMC_TX_INTERRUPT_TXGOCTIS_Msk                          /*!< MMC Transmit Good Octet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXGPKTIS_Pos             (21U)
#define ETH_MMC_TX_INTERRUPT_TXGPKTIS_Msk             (0x1UL << ETH_MMC_TX_INTERRUPT_TXGPKTIS_Pos)                 /*!< 0x00200000 */
#define ETH_MMC_TX_INTERRUPT_TXGPKTIS                 ETH_MMC_TX_INTERRUPT_TXGPKTIS_Msk                          /*!< MMC Transmit Good Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXEXDEFPIS_Pos           (22U)
#define ETH_MMC_TX_INTERRUPT_TXEXDEFPIS_Msk           (0x1UL << ETH_MMC_TX_INTERRUPT_TXEXDEFPIS_Pos)               /*!< 0x00400000 */
#define ETH_MMC_TX_INTERRUPT_TXEXDEFPIS               ETH_MMC_TX_INTERRUPT_TXEXDEFPIS_Msk                        /*!< MMC Transmit Excessive Deferral Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXPAUSPIS_Pos            (23U)
#define ETH_MMC_TX_INTERRUPT_TXPAUSPIS_Msk            (0x1UL << ETH_MMC_TX_INTERRUPT_TXPAUSPIS_Pos)                /*!< 0x00800000 */
#define ETH_MMC_TX_INTERRUPT_TXPAUSPIS                ETH_MMC_TX_INTERRUPT_TXPAUSPIS_Msk                         /*!< MMC Transmit Pause Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXVLANGPIS_Pos           (24U)
#define ETH_MMC_TX_INTERRUPT_TXVLANGPIS_Msk           (0x1UL << ETH_MMC_TX_INTERRUPT_TXVLANGPIS_Pos)               /*!< 0x01000000 */
#define ETH_MMC_TX_INTERRUPT_TXVLANGPIS               ETH_MMC_TX_INTERRUPT_TXVLANGPIS_Msk                        /*!< MMC Transmit VLAN Good Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXOSIZEGPIS_Pos          (25U)
#define ETH_MMC_TX_INTERRUPT_TXOSIZEGPIS_Msk          (0x1UL << ETH_MMC_TX_INTERRUPT_TXOSIZEGPIS_Pos)              /*!< 0x02000000 */
#define ETH_MMC_TX_INTERRUPT_TXOSIZEGPIS              ETH_MMC_TX_INTERRUPT_TXOSIZEGPIS_Msk                       /*!< MMC Transmit Oversize Good Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXLPIUSCIS_Pos           (26U)
#define ETH_MMC_TX_INTERRUPT_TXLPIUSCIS_Msk           (0x1UL << ETH_MMC_TX_INTERRUPT_TXLPIUSCIS_Pos)               /*!< 0x04000000 */
#define ETH_MMC_TX_INTERRUPT_TXLPIUSCIS               ETH_MMC_TX_INTERRUPT_TXLPIUSCIS_Msk                        /*!< MMC Transmit LPI microsecond counter interrupt status */
#define ETH_MMC_TX_INTERRUPT_TXLPITRCIS_Pos           (27U)
#define ETH_MMC_TX_INTERRUPT_TXLPITRCIS_Msk           (0x1UL << ETH_MMC_TX_INTERRUPT_TXLPITRCIS_Pos)               /*!< 0x08000000 */
#define ETH_MMC_TX_INTERRUPT_TXLPITRCIS               ETH_MMC_TX_INTERRUPT_TXLPITRCIS_Msk                        /*!< MMC Transmit LPI transition counter interrupt status */

/**********  Bit definition for ETH_MMC_RX_INTERRUPT_MASK register  ***********/
#define ETH_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_Pos                         (0U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_Msk                         (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_Pos)                        /*!< 0x00000001 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXGBPKTIM                             ETH_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_Msk                                  /*!< MMC Receive Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_Pos                         (1U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_Msk                         (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_Pos)                        /*!< 0x00000002 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXGBOCTIM                             ETH_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_Msk                                  /*!< MMC Receive Good Bad Octet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXGOCTIM_Pos                          (2U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXGOCTIM_Msk                          (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXGOCTIM_Pos)                         /*!< 0x00000004 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXGOCTIM                              ETH_MMC_RX_INTERRUPT_MASK_RXGOCTIM_Msk                                   /*!< MMC Receive Good Octet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXBCGPIM_Pos                          (3U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXBCGPIM_Msk                          (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXBCGPIM_Pos)                         /*!< 0x00000008 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXBCGPIM                              ETH_MMC_RX_INTERRUPT_MASK_RXBCGPIM_Msk                                   /*!< MMC Receive Broadcast Good Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXMCGPIM_Pos                          (4U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXMCGPIM_Msk                          (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXMCGPIM_Pos)                         /*!< 0x00000010 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXMCGPIM                              ETH_MMC_RX_INTERRUPT_MASK_RXMCGPIM_Msk                                   /*!< MMC Receive Multicast Good Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_Pos                        (5U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_Msk                        (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_Pos)                       /*!< 0x00000020 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM                            ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_Msk                                 /*!< MMC Receive CRC Error Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_Pos                       (6U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_Msk                       (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_Pos)                      /*!< 0x00000040 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM                           ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_Msk                                /*!< MMC Receive Alignment Error Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_Pos                         (7U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_Msk                         (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_Pos)                        /*!< 0x00000080 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXRUNTPIM                             ETH_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_Msk                                  /*!< MMC Receive Runt Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXJABERPIM_Pos                        (8U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXJABERPIM_Msk                        (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXJABERPIM_Pos)                       /*!< 0x00000100 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXJABERPIM                            ETH_MMC_RX_INTERRUPT_MASK_RXJABERPIM_Msk                                 /*!< MMC Receive Jabber Error Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXUSIZEGPIM_Pos                       (9U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXUSIZEGPIM_Msk                       (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXUSIZEGPIM_Pos)                      /*!< 0x00000200 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXUSIZEGPIM                           ETH_MMC_RX_INTERRUPT_MASK_RXUSIZEGPIM_Msk                                /*!< MMC Receive Undersize Good Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXOSIZEGPIM_Pos                       (10U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXOSIZEGPIM_Msk                       (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXOSIZEGPIM_Pos)                      /*!< 0x00000400 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXOSIZEGPIM                           ETH_MMC_RX_INTERRUPT_MASK_RXOSIZEGPIM_Msk                                /*!< MMC Receive Oversize Good Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RX64OCTGBPIM_Pos                      (11U)
#define ETH_MMC_RX_INTERRUPT_MASK_RX64OCTGBPIM_Msk                      (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RX64OCTGBPIM_Pos)                     /*!< 0x00000800 */
#define ETH_MMC_RX_INTERRUPT_MASK_RX64OCTGBPIM                          ETH_MMC_RX_INTERRUPT_MASK_RX64OCTGBPIM_Msk                               /*!< MMC Receive 64 Octet Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RX65T127OCTGBPIM_Pos                  (12U)
#define ETH_MMC_RX_INTERRUPT_MASK_RX65T127OCTGBPIM_Msk                  (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RX65T127OCTGBPIM_Pos)                 /*!< 0x00001000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RX65T127OCTGBPIM                      ETH_MMC_RX_INTERRUPT_MASK_RX65T127OCTGBPIM_Msk                           /*!< MMC Receive 65 to 127 Octet Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RX128T255OCTGBPIM_Pos                 (13U)
#define ETH_MMC_RX_INTERRUPT_MASK_RX128T255OCTGBPIM_Msk                 (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RX128T255OCTGBPIM_Pos)                /*!< 0x00002000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RX128T255OCTGBPIM                     ETH_MMC_RX_INTERRUPT_MASK_RX128T255OCTGBPIM_Msk                          /*!< MMC Receive 128 to 255 Octet Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RX256T511OCTGBPIM_Pos                 (14U)
#define ETH_MMC_RX_INTERRUPT_MASK_RX256T511OCTGBPIM_Msk                 (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RX256T511OCTGBPIM_Pos)                /*!< 0x00004000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RX256T511OCTGBPIM                     ETH_MMC_RX_INTERRUPT_MASK_RX256T511OCTGBPIM_Msk                          /*!< MMC Receive 256 to 511 Octet Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RX512T1023OCTGBPIM_Pos                (15U)
#define ETH_MMC_RX_INTERRUPT_MASK_RX512T1023OCTGBPIM_Msk                (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RX512T1023OCTGBPIM_Pos)               /*!< 0x00008000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RX512T1023OCTGBPIM                    ETH_MMC_RX_INTERRUPT_MASK_RX512T1023OCTGBPIM_Msk                         /*!< MMC Receive 512 to 1023 Octet Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RX1024TMAXOCTGBPIM_Pos                (16U)
#define ETH_MMC_RX_INTERRUPT_MASK_RX1024TMAXOCTGBPIM_Msk                (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RX1024TMAXOCTGBPIM_Pos)               /*!< 0x00010000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RX1024TMAXOCTGBPIM                    ETH_MMC_RX_INTERRUPT_MASK_RX1024TMAXOCTGBPIM_Msk                         /*!< MMC Receive 1024 to Maximum Octet Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM_Pos                          (17U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM_Msk                          (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM_Pos)                         /*!< 0x00020000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM                              ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM_Msk                                   /*!< MMC Receive Unicast Good Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXLENERPIM_Pos                        (18U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXLENERPIM_Msk                        (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXLENERPIM_Pos)                       /*!< 0x00040000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXLENERPIM                            ETH_MMC_RX_INTERRUPT_MASK_RXLENERPIM_Msk                                 /*!< MMC Receive Length Error Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXORANGEPIM_Pos                       (19U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXORANGEPIM_Msk                       (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXORANGEPIM_Pos)                      /*!< 0x00080000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXORANGEPIM                           ETH_MMC_RX_INTERRUPT_MASK_RXORANGEPIM_Msk                                /*!< MMC Receive Out Of Range Error Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXPAUSPIM_Pos                         (20U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXPAUSPIM_Msk                         (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXPAUSPIM_Pos)                        /*!< 0x00100000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXPAUSPIM                             ETH_MMC_RX_INTERRUPT_MASK_RXPAUSPIM_Msk                                  /*!< MMC Receive Pause Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXFOVPIM_Pos                          (21U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXFOVPIM_Msk                          (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXFOVPIM_Pos)                         /*!< 0x00200000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXFOVPIM                              ETH_MMC_RX_INTERRUPT_MASK_RXFOVPIM_Msk                                   /*!< MMC Receive FIFO Overflow Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXVLANGBPIM_Pos                       (22U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXVLANGBPIM_Msk                       (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXVLANGBPIM_Pos)                      /*!< 0x00400000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXVLANGBPIM                           ETH_MMC_RX_INTERRUPT_MASK_RXVLANGBPIM_Msk                                /*!< MMC Receive VLAN Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXWDOGPIM_Pos                         (23U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXWDOGPIM_Msk                         (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXWDOGPIM_Pos)                        /*!< 0x00800000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXWDOGPIM                             ETH_MMC_RX_INTERRUPT_MASK_RXWDOGPIM_Msk                                  /*!< MMC Receive Watchdog Error Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXRCVERRPIM_Pos                       (24U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXRCVERRPIM_Msk                       (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXRCVERRPIM_Pos)                      /*!< 0x01000000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXRCVERRPIM                           ETH_MMC_RX_INTERRUPT_MASK_RXRCVERRPIM_Msk                                /*!< MMC Receive Error Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXCTRLPIM_Pos                         (25U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXCTRLPIM_Msk                         (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXCTRLPIM_Pos)                        /*!< 0x02000000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXCTRLPIM                             ETH_MMC_RX_INTERRUPT_MASK_RXCTRLPIM_Msk                                  /*!< MMC Receive Control Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM_Pos                        (26U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM_Msk                        (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM_Pos)                       /*!< 0x04000000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM                            ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM_Msk                                 /*!< MMC Receive LPI microsecond counter interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM_Pos                        (27U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM_Msk                        (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM_Pos)                       /*!< 0x08000000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM                            ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM_Msk                                 /*!< MMC Receive LPI transition counter interrupt Mask */

