STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233fxx_ca35.h
/***************  Bit definition for ETH_DMAMR register  ***************/
#define ETH_DMAMR_SWR_Pos                   (0U)
#define ETH_DMAMR_SWR_Msk                   (0x1UL << ETH_DMAMR_SWR_Pos)                         /*!< 0x00000001 */
#define ETH_DMAMR_SWR                       ETH_DMAMR_SWR_Msk                                   /*!< Software Reset */
#define ETH_DMAMR_TAA_Pos                   (2U)
#define ETH_DMAMR_TAA_Msk                   (0x7UL << ETH_DMAMR_TAA_Pos)                         /*!< 0x0000001C */
#define ETH_DMAMR_TAA                       ETH_DMAMR_TAA_Msk                                   /*!< Transmit Arbitration Algorithm */
#define ETH_DMAMR_TAA0_Pos                  (2U)
#define ETH_DMAMR_TAA0_Msk                  (0x1UL << ETH_DMAMR_TAA0_Pos)                         /*!< 0x00000004 */
#define ETH_DMAMR_TAA0                      ETH_DMAMR_TAA0_Msk                                  /*!< Transmit Arbitration Algorithm */
#define ETH_DMAMR_TAA1_Pos                  (3U)
#define ETH_DMAMR_TAA1_Msk                  (0x1UL << ETH_DMAMR_TAA1_Pos)                         /*!< 0x00000008 */
#define ETH_DMAMR_TAA1                      ETH_DMAMR_TAA1_Msk                                  /*!< Transmit Arbitration Algorithm */
#define ETH_DMAMR_TAA2_Pos                  (4U)
#define ETH_DMAMR_TAA2_Msk                  (0x1UL << ETH_DMAMR_TAA2_Pos)                         /*!< 0x00000010 */
#define ETH_DMAMR_TAA2                      ETH_DMAMR_TAA2_Msk                                  /*!< Transmit Arbitration Algorithm */
#define ETH_DMAMR_DSPW_Pos                  (8)
#define ETH_DMAMR_DSPW_Msk                  (0x1UL << ETH_DMAMR_DSPW_Pos)                        /*!< 0x00000100 */
#define ETH_DMAMR_DSPW                      ETH_DMAMR_DSPW_Msk                                  /*!< Descriptor Posted Write */
#define ETH_DMAMR_TXPR_Pos                  (11U)
#define ETH_DMAMR_TXPR_Msk                  (0x1UL << ETH_DMAMR_TXPR_Pos)                        /*!< 0x00000800 */
#define ETH_DMAMR_TXPR                      ETH_DMAMR_TXPR_Msk                                  /*!< Transmit priority */
#define ETH_DMAMR_INTM_Pos                  (16U)
#define ETH_DMAMR_INTM_Msk                  (0x3UL << ETH_DMAMR_INTM_Pos)                        /*!< 0x00030000 */
#define ETH_DMAMR_INTM                      ETH_DMAMR_INTM_Msk                                  /*!< Interrupt Mode */
#define ETH_DMAMR_INTM_0                    (0x1UL << ETH_DMAMR_INTM_Pos)                        /*!< 0x00010000 */
#define ETH_DMAMR_INTM_1                    (0x2UL << ETH_DMAMR_INTM_Pos)                        /*!< 0x00020000 */

/**************  Bit definition for ETH_DMASBMR register  **************/
#define ETH_DMASBMR_FB_Pos                  (0U)
#define ETH_DMASBMR_FB_Msk                  (0x1UL << ETH_DMASBMR_FB_Pos)                        /*!< 0x00000001 */
#define ETH_DMASBMR_FB                      ETH_DMASBMR_FB_Msk                                  /*!< Fixed Burst Length */
#define ETH_DMASBMR_BLEN4_Pos               (1U)
#define ETH_DMASBMR_BLEN4_Msk               (0x1UL << ETH_DMASBMR_BLEN4_Pos)                     /*!< 0x00000002 */
#define ETH_DMASBMR_BLEN4                   ETH_DMASBMR_BLEN4_Msk                               /*!< AXI Burst Length 4 */
#define ETH_DMASBMR_BLEN8_Pos               (2U)
#define ETH_DMASBMR_BLEN8_Msk               (0x1UL << ETH_DMASBMR_BLEN8_Pos)                     /*!< 0x00000004 */
#define ETH_DMASBMR_BLEN8                   ETH_DMASBMR_BLEN8_Msk                               /*!< AXI Burst Length 8 */
#define ETH_DMASBMR_BLEN16_Pos              (3U)
#define ETH_DMASBMR_BLEN16_Msk              (0x1UL << ETH_DMASBMR_BLEN16_Pos)                    /*!< 0x00000008 */
#define ETH_DMASBMR_BLEN16                  ETH_DMASBMR_BLEN16_Msk                              /*!< AXI Burst Length 16 */
#define ETH_DMASBMR_BLEN32_Pos              (4U)
#define ETH_DMASBMR_BLEN32_Msk              (0x1UL << ETH_DMASBMR_BLEN32_Pos)                    /*!< 0x00000010 */
#define ETH_DMASBMR_BLEN32                  ETH_DMASBMR_BLEN32_Msk                              /*!< AXI Burst Length 32 */
#define ETH_DMASBMR_BLEN64_Pos              (5U)
#define ETH_DMASBMR_BLEN64_Msk              (0x1UL << ETH_DMASBMR_BLEN64_Pos)                    /*!< 0x00000020 */
#define ETH_DMASBMR_BLEN64                  ETH_DMASBMR_BLEN64_Msk                              /*!< AXI Burst Length 64 */
#define ETH_DMASBMR_BLEN128_Pos             (6U)
#define ETH_DMASBMR_BLEN128_Msk             (0x1UL << ETH_DMASBMR_BLEN128_Pos)                   /*!< 0x00000040 */
#define ETH_DMASBMR_BLEN128                 ETH_DMASBMR_BLEN128_Msk                             /*!< AXI Burst Length 128 */
#define ETH_DMASBMR_BLEN256_Pos             (7U)
#define ETH_DMASBMR_BLEN256_Msk             (0x1UL << ETH_DMASBMR_BLEN256_Pos)                   /*!< 0x00000080 */
#define ETH_DMASBMR_BLEN256                 ETH_DMASBMR_BLEN256_Msk                             /*!< AXI Burst Length 256 */
#define ETH_DMASBMR_AALE_Pos                (10U)
#define ETH_DMASBMR_AALE_Msk                (0x1UL << ETH_DMASBMR_AALE_Pos)                      /*!< 0x00000400 */
#define ETH_DMASBMR_AALE                    ETH_DMASBMR_AALE_Msk                                /*!< Automatic AXI LPI enable */
#define ETH_DMASBMR_AAL_Pos                 (12U)
#define ETH_DMASBMR_AAL_Msk                 (0x1UL << ETH_DMASBMR_AAL_Pos)                       /*!< 0x00001000 */
#define ETH_DMASBMR_AAL                     ETH_DMASBMR_AAL_Msk                                 /*!< Address-Aligned Beats */
#define ETH_DMASBMR_ONEKBBE_Pos             (13U)
#define ETH_DMASBMR_ONEKBBE_Msk             (0x1UL << ETH_DMASBMR_ONEKBBE_Pos)                   /*!< 0x00002000 */
#define ETH_DMASBMR_ONEKBBE                 ETH_DMASBMR_ONEKBBE_Msk                             /*!< 1 Kbyte Boundary Crossing Enable for the AXI Master */
#define ETH_DMASBMR_RD_OSR_LMT_Pos          (16U)
#define ETH_DMASBMR_RD_OSR_LMT_Msk          (0x3UL << ETH_DMASBMR_RD_OSR_LMT_Pos)                /*!< 0x00030000 */
#define ETH_DMASBMR_RD_OSR_LMT              ETH_DMASBMR_RD_OSR_LMT_Msk                          /*!< AXI Maximum Read Outstanding Request Limit */
#define ETH_DMASBMR_RD_OSR_LMT_0            (0x1UL << ETH_DMASBMR_RD_OSR_LMT_Pos)                /*!< 0x00010000 */
#define ETH_DMASBMR_RD_OSR_LMT_1            (0x2UL << ETH_DMASBMR_RD_OSR_LMT_Pos)                /*!< 0x00020000 */
#define ETH_DMASBMR_WR_OSR_LMT_Pos          (24U)
#define ETH_DMASBMR_WR_OSR_LMT_Msk          (0x3UL << ETH_DMASBMR_WR_OSR_LMT_Pos)                /*!< 0x03000000 */
#define ETH_DMASBMR_WR_OSR_LMT              ETH_DMASBMR_WR_OSR_LMT_Msk                          /*!< AXI Maximum Write Outstanding Request Limit */
#define ETH_DMASBMR_WR_OSR_LMT_0            (0x1UL << ETH_DMASBMR_WR_OSR_LMT_Pos)                /*!< 0x01000000 */
#define ETH_DMASBMR_WR_OSR_LMT_1            (0x2UL << ETH_DMASBMR_WR_OSR_LMT_Pos)                /*!< 0x02000000 */
#define ETH_DMASBMR_LPI_XIT_PKT_Pos         (30U)
#define ETH_DMASBMR_LPI_XIT_PKT_Msk         (0x1UL << ETH_DMASBMR_LPI_XIT_PKT_Pos)               /*!< 0x40000000 */
#define ETH_DMASBMR_LPI_XIT_PKT             ETH_DMASBMR_LPI_XIT_PKT_Msk                         /*!< Unlock on Magic Packet or Remote wakeup Packet */
#define ETH_DMASBMR_EN_LPI_Pos              (31U)
#define ETH_DMASBMR_EN_LPI_Msk              (0x1UL << ETH_DMASBMR_EN_LPI_Pos)                    /*!< 0x80000000 */
#define ETH_DMASBMR_EN_LPI                  ETH_DMASBMR_EN_LPI_Msk                              /*!< Enable Low Power Interface (LPI) */

/**************  Bit definition for ETH_DMAISR register  ***************/
#define ETH_DMAISR_DC0IS_Pos                (0U)
#define ETH_DMAISR_DC0IS_Msk                (0x1UL << ETH_DMAISR_DC0IS_Pos)                      /*!< 0x00000001 */
#define ETH_DMAISR_DC0IS                    ETH_DMAISR_DC0IS_Msk                                /*!< DMA Channel 0 Interrupt Status */
#define ETH_DMAISR_DC1IS_Pos                (1U)
#define ETH_DMAISR_DC1IS_Msk                (0x1UL << ETH_DMAISR_DC1IS_Pos)                      /*!< 0x00000002 */
#define ETH_DMAISR_DC1IS                    ETH_DMAISR_DC1IS_Msk                                /*!< DMA Channel 1 Interrupt Status */
#define ETH_DMAISR_DC2IS_Pos                (2U)
#define ETH_DMAISR_DC2IS_Msk                (0x1UL << ETH_DMAISR_DC2IS_Pos)                      /*!< 0x00000004 */
#define ETH_DMAISR_DC2IS                    ETH_DMAISR_DC2IS_Msk                                /*!< DMA Channel 2 Interrupt Status */
#define ETH_DMAISR_DC3IS_Pos                (3U)
#define ETH_DMAISR_DC3IS_Msk                (0x1UL << ETH_DMAISR_DC3IS_Pos)                      /*!< 0x00000008 */
#define ETH_DMAISR_DC3IS                    ETH_DMAISR_DC3IS_Msk                                /*!< DMA Channel 3 Interrupt Status */
#define ETH_DMAISR_MTLIS_Pos                (16U)
#define ETH_DMAISR_MTLIS_Msk                (0x1UL << ETH_DMAISR_MTLIS_Pos)                      /*!< 0x00010000 */
#define ETH_DMAISR_MTLIS                    ETH_DMAISR_MTLIS_Msk                                /*!< MTL Interrupt Status */
#define ETH_DMAISR_MACIS_Pos                (17U)
#define ETH_DMAISR_MACIS_Msk                (0x1UL << ETH_DMAISR_MACIS_Pos)                      /*!< 0x00020000 */
#define ETH_DMAISR_MACIS                    ETH_DMAISR_MACIS_Msk                                /*!< MAC Interrupt Status */

/**************  Bit definition for ETH_DMADS1R register  ***************/
#define ETH_DMADS1R_AXWHSTS_Pos              (0U)
#define ETH_DMADS1R_AXWHSTS_Msk              (0x1UL << ETH_DMADS1R_AXWHSTS_Pos)                   /*!< 0x00000001 */
#define ETH_DMADS1R_AXWHSTS                  ETH_DMADS1R_AXWHSTS_Msk                             /*!< AXI Master Write Channel */
#define ETH_DMADS1R_AXRHSTS_Pos              (1U)
#define ETH_DMADS1R_AXRHSTS_Msk              (0x1UL << ETH_DMADS1R_AXRHSTS_Pos)                   /*!< 0x00000002 */
#define ETH_DMADS1R_AXRHSTS                  ETH_DMADS1R_AXRHSTS_Msk                             /*!< AXI Master Read Channel Status */
#define ETH_DMADS1R_RPS0_Pos                 (8U)
#define ETH_DMADS1R_RPS0_Msk                 (0xFUL << ETH_DMADS1R_RPS0_Pos)                      /*!< 0x00000F00 */
#define ETH_DMADS1R_RPS0                     ETH_DMADS1R_RPS0_Msk                                /*!< DMA Channel Receive Process State */
#define ETH_DMADS1R_TPS0_Pos                 (12U)
#define ETH_DMADS1R_TPS0_Msk                 (0xFUL << ETH_DMADS1R_TPS0_Pos)                      /*!< 0x0000F000 */
#define ETH_DMADS1R_TPS0                     ETH_DMADS1R_TPS0_Msk                                /*!< DMA Channel Transmit Process State */
#define ETH_DMADS1R_RPS1_Pos                 (16U)
#define ETH_DMADS1R_RPS1_Msk                 (0xFUL << ETH_DMADS1R_RPS1_Pos)                      /*!< 0x000F0000 */
#define ETH_DMADS1R_RPS1                     ETH_DMADS1R_RPS1_Msk                                /*!< DMA Channel 1 Receive Process State */
#define ETH_DMADS1R_TPS1_Pos                 (20U)
#define ETH_DMADS1R_TPS1_Msk                 (0xFUL << ETH_DMADS1R_TPS1_Pos)                      /*!< 0x00F00000 */
#define ETH_DMADS1R_TPS1                     ETH_DMADS1R_TPS1_Msk                                /*!< DMA Channel 1 Transmit Process State */
#define ETH_DMADS1R_TPS2_Pos                 (28U)
#define ETH_DMADS1R_TPS2_Msk                 (0xFUL << ETH_DMADS1R_TPS2_Pos)                      /*!< 0xF0000000 */
#define ETH_DMADS1R_TPS2                     ETH_DMADS1R_TPS2_Msk                                /*!< DMA Channel 2 Transmit Process State */

/*****************  Bit definition for ETH_DMADS2R register  ******************/
#define ETH_DMADS2R_TPS3_Pos                 (4U)
#define ETH_DMADS2R_TPS3_Msk                 (0xFUL << ETH_DMADS2R_TPS3_Pos)                      /*!< 0x000000F0 */
#define ETH_DMADS2R_TPS3                     ETH_DMADS2R_TPS3_Msk                                /*!< DMA Channel 3 Transmit Process State */

/************  Bit definition for ETH_DMAA4TXACR register  *************/
#define ETH_DMAA4TXACR_TDRC_Pos             (0U)
#define ETH_DMAA4TXACR_TDRC_Msk             (0xFUL << ETH_DMAA4TXACR_TDRC_Pos)                   /*!< 0x0000000F */
#define ETH_DMAA4TXACR_TDRC                 ETH_DMAA4TXACR_TDRC_Msk                             /*!< Transmit DMA Read Descriptor Cache Control */
#define ETH_DMAA4TXACR_TDRC_0               (0x1UL << ETH_DMAA4TXACR_TDRC_Pos)                   /*!< 0x00000001 */
#define ETH_DMAA4TXACR_TDRC_1               (0x2UL << ETH_DMAA4TXACR_TDRC_Pos)                   /*!< 0x00000002 */
#define ETH_DMAA4TXACR_TDRC_2               (0x4UL << ETH_DMAA4TXACR_TDRC_Pos)                   /*!< 0x00000004 */
#define ETH_DMAA4TXACR_TDRC_3               (0x8UL << ETH_DMAA4TXACR_TDRC_Pos)                   /*!< 0x00000008 */
#define ETH_DMAA4TXACR_TEC_Pos              (8U)
#define ETH_DMAA4TXACR_TEC_Msk              (0xFUL << ETH_DMAA4TXACR_TEC_Pos)                    /*!< 0x00000F00 */
#define ETH_DMAA4TXACR_TEC                  ETH_DMAA4TXACR_TEC_Msk                              /*!< Transmit DMA Extended Packet Buffer or TSO Payload Cache Control */
#define ETH_DMAA4TXACR_TEC_0                (0x1UL << ETH_DMAA4TXACR_TEC_Pos)                    /*!< 0x00000100 */
#define ETH_DMAA4TXACR_TEC_1                (0x2UL << ETH_DMAA4TXACR_TEC_Pos)                    /*!< 0x00000200 */
#define ETH_DMAA4TXACR_TEC_2                (0x4UL << ETH_DMAA4TXACR_TEC_Pos)                    /*!< 0x00000400 */
#define ETH_DMAA4TXACR_TEC_3                (0x8UL << ETH_DMAA4TXACR_TEC_Pos)                    /*!< 0x00000800 */
#define ETH_DMAA4TXACR_THC_Pos              (16U)
#define ETH_DMAA4TXACR_THC_Msk              (0xFUL << ETH_DMAA4TXACR_THC_Pos)                    /*!< 0x000F0000 */
#define ETH_DMAA4TXACR_THC                  ETH_DMAA4TXACR_THC_Msk                              /*!< Transmit DMA First Packet Buffer or TSO Header Cache Control */
#define ETH_DMAA4TXACR_THC_0                (0x1UL << ETH_DMAA4TXACR_THC_Pos)                    /*!< 0x00010000 */
#define ETH_DMAA4TXACR_THC_1                (0x2UL << ETH_DMAA4TXACR_THC_Pos)                    /*!< 0x00020000 */
#define ETH_DMAA4TXACR_THC_2                (0x4UL << ETH_DMAA4TXACR_THC_Pos)                    /*!< 0x00040000 */
#define ETH_DMAA4TXACR_THC_3                (0x8UL << ETH_DMAA4TXACR_THC_Pos)                    /*!< 0x00080000 */

/************  Bit definition for ETH_DMAA4RXACR register  *************/
#define ETH_DMAA4RXACR_RDWC_Pos             (0U)
#define ETH_DMAA4RXACR_RDWC_Msk             (0xFUL << ETH_DMAA4RXACR_RDWC_Pos)                   /*!< 0x0000000F */
#define ETH_DMAA4RXACR_RDWC                 ETH_DMAA4RXACR_RDWC_Msk                             /*!< Receive DMA Write Descriptor Cache Control */
#define ETH_DMAA4RXACR_RDWC_0               (0x1UL << ETH_DMAA4RXACR_RDWC_Pos)                   /*!< 0x00000001 */
#define ETH_DMAA4RXACR_RDWC_1               (0x2UL << ETH_DMAA4RXACR_RDWC_Pos)                   /*!< 0x00000002 */
#define ETH_DMAA4RXACR_RDWC_2               (0x4UL << ETH_DMAA4RXACR_RDWC_Pos)                   /*!< 0x00000004 */
#define ETH_DMAA4RXACR_RDWC_3               (0x8UL << ETH_DMAA4RXACR_RDWC_Pos)                   /*!< 0x00000008 */
#define ETH_DMAA4RXACR_RPC_Pos              (8U)
#define ETH_DMAA4RXACR_RPC_Msk              (0xFUL << ETH_DMAA4RXACR_RPC_Pos)                    /*!< 0x00000F00 */
#define ETH_DMAA4RXACR_RPC                  ETH_DMAA4RXACR_RPC_Msk                              /*!< Receive DMA Payload Cache Control */
#define ETH_DMAA4RXACR_RPC_0                (0x1UL << ETH_DMAA4RXACR_RPC_Pos)                    /*!< 0x00000100 */
#define ETH_DMAA4RXACR_RPC_1                (0x2UL << ETH_DMAA4RXACR_RPC_Pos)                    /*!< 0x00000200 */
#define ETH_DMAA4RXACR_RPC_2                (0x4UL << ETH_DMAA4RXACR_RPC_Pos)                    /*!< 0x00000400 */
#define ETH_DMAA4RXACR_RPC_3                (0x8UL << ETH_DMAA4RXACR_RPC_Pos)                    /*!< 0x00000800 */
#define ETH_DMAA4RXACR_RHC_Pos              (16U)
#define ETH_DMAA4RXACR_RHC_Msk              (0xFUL << ETH_DMAA4RXACR_RHC_Pos)                    /*!< 0x000F0000 */
#define ETH_DMAA4RXACR_RHC                  ETH_DMAA4RXACR_RHC_Msk                              /*!< Receive DMA Header Cache Control */
#define ETH_DMAA4RXACR_RHC_0                (0x1UL << ETH_DMAA4RXACR_RHC_Pos)                    /*!< 0x00010000 */
#define ETH_DMAA4RXACR_RHC_1                (0x2UL << ETH_DMAA4RXACR_RHC_Pos)                    /*!< 0x00020000 */
#define ETH_DMAA4RXACR_RHC_2                (0x4UL << ETH_DMAA4RXACR_RHC_Pos)                    /*!< 0x00040000 */
#define ETH_DMAA4RXACR_RHC_3                (0x8UL << ETH_DMAA4RXACR_RHC_Pos)                    /*!< 0x00080000 */
#define ETH_DMAA4RXACR_RDC_Pos              (24U)
#define ETH_DMAA4RXACR_RDC_Msk              (0xFUL << ETH_DMAA4RXACR_RDC_Pos)                    /*!< 0x0F000000 */
#define ETH_DMAA4RXACR_RDC                  ETH_DMAA4RXACR_RDC_Msk                              /*!< Receive DMA Buffer Cache Control */
#define ETH_DMAA4RXACR_RDC_0                (0x1UL << ETH_DMAA4RXACR_RDC_Pos)                    /*!< 0x01000000 */
#define ETH_DMAA4RXACR_RDC_1                (0x2UL << ETH_DMAA4RXACR_RDC_Pos)                    /*!< 0x02000000 */
#define ETH_DMAA4RXACR_RDC_2                (0x4UL << ETH_DMAA4RXACR_RDC_Pos)                    /*!< 0x04000000 */
#define ETH_DMAA4RXACR_RDC_3                (0x8UL << ETH_DMAA4RXACR_RDC_Pos)                    /*!< 0x08000000 */

