STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233fxx_ca35.h
/******************  Bit definition for EXTI_EnCIDCFGR register  *******************/
#define EXTI_EnCIDCFGR_CFEN_Pos      (0U)
#define EXTI_EnCIDCFGR_CFEN_Msk      (0x1UL << EXTI_EnCIDCFGR_CFEN_Pos)
#define EXTI_EnCIDCFGR_CFEN          EXTI_EnCIDCFGR_CFEN_Msk                     /*!< CID filtering enable*/
#define EXTI_EnCIDCFGR_CID_Pos       (4U)
#define EXTI_EnCIDCFGR_CID_Msk       (0x3UL << EXTI_EnCIDCFGR_CID_Pos)
#define EXTI_EnCIDCFGR_CID           EXTI_EnCIDCFGR_CID_Msk                     /*!< static CID value*/

/******************  Bit definition for EXTI_CmCIDCFGR register  *******************/
#define EXTI_CmCIDCFGR_CFEN_Pos      (0U)
#define EXTI_CmCIDCFGR_CFEN_Msk      (0x1UL << EXTI_CmCIDCFGR_CFEN_Pos)
#define EXTI_CmCIDCFGR_CFEN          EXTI_CmCIDCFGR_CFEN_Msk                     /*!< CID filtering enable*/
#define EXTI_CmCIDCFGR_CID_Pos       (4U)
#define EXTI_CmCIDCFGR_CID_Msk       (0x3UL << EXTI_CmCIDCFGR_CID_Pos)
#define EXTI_CmCIDCFGR_CID           EXTI_CmCIDCFGR_CID_Msk                     /*!< static CID value*/



/* EXTI2 */


/******************  Bit definition for EXTI2_RTSR1 register  *******************/
#define EXTI2_RTSR1_RT0_Pos         (0U)
#define EXTI2_RTSR1_RT0_Msk         (0x1UL << EXTI2_RTSR1_RT0_Pos)                /*!< 0x00000001 */
#define EXTI2_RTSR1_RT0             EXTI2_RTSR1_RT0_Msk                          /*!< Rising trigger event configuration bit of line 0 */
#define EXTI2_RTSR1_RT1_Pos         (1U)
#define EXTI2_RTSR1_RT1_Msk         (0x1UL << EXTI2_RTSR1_RT1_Pos)                /*!< 0x00000002 */
#define EXTI2_RTSR1_RT1             EXTI2_RTSR1_RT1_Msk                          /*!< Rising trigger event configuration bit of line 1 */
#define EXTI2_RTSR1_RT2_Pos         (2U)
#define EXTI2_RTSR1_RT2_Msk         (0x1UL << EXTI2_RTSR1_RT2_Pos)                /*!< 0x00000004 */
#define EXTI2_RTSR1_RT2             EXTI2_RTSR1_RT2_Msk                          /*!< Rising trigger event configuration bit of line 2 */
#define EXTI2_RTSR1_RT3_Pos         (3U)
#define EXTI2_RTSR1_RT3_Msk         (0x1UL << EXTI2_RTSR1_RT3_Pos)                /*!< 0x00000008 */
#define EXTI2_RTSR1_RT3             EXTI2_RTSR1_RT3_Msk                          /*!< Rising trigger event configuration bit of line 3 */
#define EXTI2_RTSR1_RT4_Pos         (4U)
#define EXTI2_RTSR1_RT4_Msk         (0x1UL << EXTI2_RTSR1_RT4_Pos)                /*!< 0x00000010 */
#define EXTI2_RTSR1_RT4             EXTI2_RTSR1_RT4_Msk                          /*!< Rising trigger event configuration bit of line 4 */
#define EXTI2_RTSR1_RT5_Pos         (5U)
#define EXTI2_RTSR1_RT5_Msk         (0x1UL << EXTI2_RTSR1_RT5_Pos)                /*!< 0x00000020 */
#define EXTI2_RTSR1_RT5             EXTI2_RTSR1_RT5_Msk                          /*!< Rising trigger event configuration bit of line 5 */
#define EXTI2_RTSR1_RT6_Pos         (6U)
#define EXTI2_RTSR1_RT6_Msk         (0x1UL << EXTI2_RTSR1_RT6_Pos)                /*!< 0x00000040 */
#define EXTI2_RTSR1_RT6             EXTI2_RTSR1_RT6_Msk                          /*!< Rising trigger event configuration bit of line 6 */
#define EXTI2_RTSR1_RT7_Pos         (7U)
#define EXTI2_RTSR1_RT7_Msk         (0x1UL << EXTI2_RTSR1_RT7_Pos)                /*!< 0x00000080 */
#define EXTI2_RTSR1_RT7             EXTI2_RTSR1_RT7_Msk                          /*!< Rising trigger event configuration bit of line 7 */
#define EXTI2_RTSR1_RT8_Pos         (8U)
#define EXTI2_RTSR1_RT8_Msk         (0x1UL << EXTI2_RTSR1_RT8_Pos)                /*!< 0x00000100 */
#define EXTI2_RTSR1_RT8             EXTI2_RTSR1_RT8_Msk                          /*!< Rising trigger event configuration bit of line 8 */
#define EXTI2_RTSR1_RT9_Pos         (9U)
#define EXTI2_RTSR1_RT9_Msk         (0x1UL << EXTI2_RTSR1_RT9_Pos)                /*!< 0x00000200 */
#define EXTI2_RTSR1_RT9             EXTI2_RTSR1_RT9_Msk                          /*!< Rising trigger event configuration bit of line 9 */
#define EXTI2_RTSR1_RT10_Pos        (10U)
#define EXTI2_RTSR1_RT10_Msk        (0x1UL << EXTI2_RTSR1_RT10_Pos)               /*!< 0x00000400 */
#define EXTI2_RTSR1_RT10            EXTI2_RTSR1_RT10_Msk                         /*!< Rising trigger event configuration bit of line 10 */
#define EXTI2_RTSR1_RT11_Pos        (11U)
#define EXTI2_RTSR1_RT11_Msk        (0x1UL << EXTI2_RTSR1_RT11_Pos)               /*!< 0x00000800 */
#define EXTI2_RTSR1_RT11            EXTI2_RTSR1_RT11_Msk                         /*!< Rising trigger event configuration bit of line 11 */
#define EXTI2_RTSR1_RT12_Pos        (12U)
#define EXTI2_RTSR1_RT12_Msk        (0x1UL << EXTI2_RTSR1_RT12_Pos)               /*!< 0x00001000 */
#define EXTI2_RTSR1_RT12            EXTI2_RTSR1_RT12_Msk                         /*!< Rising trigger event configuration bit of line 12 */
#define EXTI2_RTSR1_RT13_Pos        (13U)
#define EXTI2_RTSR1_RT13_Msk        (0x1UL << EXTI2_RTSR1_RT13_Pos)               /*!< 0x00002000 */
#define EXTI2_RTSR1_RT13            EXTI2_RTSR1_RT13_Msk                         /*!< Rising trigger event configuration bit of line 13 */
#define EXTI2_RTSR1_RT14_Pos        (14U)
#define EXTI2_RTSR1_RT14_Msk        (0x1UL << EXTI2_RTSR1_RT14_Pos)               /*!< 0x00004000 */
#define EXTI2_RTSR1_RT14            EXTI2_RTSR1_RT14_Msk                         /*!< Rising trigger event configuration bit of line 14 */
#define EXTI2_RTSR1_RT15_Pos        (15U)
#define EXTI2_RTSR1_RT15_Msk        (0x1UL << EXTI2_RTSR1_RT15_Pos)               /*!< 0x00008000 */
#define EXTI2_RTSR1_RT15            EXTI2_RTSR1_RT15_Msk                         /*!< Rising trigger event configuration bit of line 15 */

/******************  Bit definition for EXTI2_FTSR1 register  *******************/
#define EXTI2_FTSR1_FT0_Pos         (0U)
#define EXTI2_FTSR1_FT0_Msk         (0x1UL << EXTI2_FTSR1_FT0_Pos)                /*!< 0x00000001 */
#define EXTI2_FTSR1_FT0             EXTI2_FTSR1_FT0_Msk                          /*!< Falling trigger event configuration bit of line 0 */
#define EXTI2_FTSR1_FT1_Pos         (1U)
#define EXTI2_FTSR1_FT1_Msk         (0x1UL << EXTI2_FTSR1_FT1_Pos)                /*!< 0x00000002 */
#define EXTI2_FTSR1_FT1             EXTI2_FTSR1_FT1_Msk                          /*!< Falling trigger event configuration bit of line 1 */
#define EXTI2_FTSR1_FT2_Pos         (2U)
#define EXTI2_FTSR1_FT2_Msk         (0x1UL << EXTI2_FTSR1_FT2_Pos)                /*!< 0x00000004 */
#define EXTI2_FTSR1_FT2             EXTI2_FTSR1_FT2_Msk                          /*!< Falling trigger event configuration bit of line 2 */
#define EXTI2_FTSR1_FT3_Pos         (3U)
#define EXTI2_FTSR1_FT3_Msk         (0x1UL << EXTI2_FTSR1_FT3_Pos)                /*!< 0x00000008 */
#define EXTI2_FTSR1_FT3             EXTI2_FTSR1_FT3_Msk                          /*!< Falling trigger event configuration bit of line 3 */
#define EXTI2_FTSR1_FT4_Pos         (4U)
#define EXTI2_FTSR1_FT4_Msk         (0x1UL << EXTI2_FTSR1_FT4_Pos)                /*!< 0x00000010 */
#define EXTI2_FTSR1_FT4             EXTI2_FTSR1_FT4_Msk                          /*!< Falling trigger event configuration bit of line 4 */
#define EXTI2_FTSR1_FT5_Pos         (5U)
#define EXTI2_FTSR1_FT5_Msk         (0x1UL << EXTI2_FTSR1_FT5_Pos)                /*!< 0x00000020 */
#define EXTI2_FTSR1_FT5             EXTI2_FTSR1_FT5_Msk                          /*!< Falling trigger event configuration bit of line 5 */
#define EXTI2_FTSR1_FT6_Pos         (6U)
#define EXTI2_FTSR1_FT6_Msk         (0x1UL << EXTI2_FTSR1_FT6_Pos)                /*!< 0x00000040 */
#define EXTI2_FTSR1_FT6             EXTI2_FTSR1_FT6_Msk                          /*!< Falling trigger event configuration bit of line 6 */
#define EXTI2_FTSR1_FT7_Pos         (7U)
#define EXTI2_FTSR1_FT7_Msk         (0x1UL << EXTI2_FTSR1_FT7_Pos)                /*!< 0x00000080 */
#define EXTI2_FTSR1_FT7             EXTI2_FTSR1_FT7_Msk                          /*!< Falling trigger event configuration bit of line 7 */
#define EXTI2_FTSR1_FT8_Pos         (8U)
#define EXTI2_FTSR1_FT8_Msk         (0x1UL << EXTI2_FTSR1_FT8_Pos)                /*!< 0x00000100 */
#define EXTI2_FTSR1_FT8             EXTI2_FTSR1_FT8_Msk                          /*!< Falling trigger event configuration bit of line 8 */
#define EXTI2_FTSR1_FT9_Pos         (9U)
#define EXTI2_FTSR1_FT9_Msk         (0x1UL << EXTI2_FTSR1_FT9_Pos)                /*!< 0x00000200 */
#define EXTI2_FTSR1_FT9             EXTI2_FTSR1_FT9_Msk                          /*!< Falling trigger event configuration bit of line 9 */
#define EXTI2_FTSR1_FT10_Pos        (10U)
#define EXTI2_FTSR1_FT10_Msk        (0x1UL << EXTI2_FTSR1_FT10_Pos)               /*!< 0x00000400 */
#define EXTI2_FTSR1_FT10            EXTI2_FTSR1_FT10_Msk                         /*!< Falling trigger event configuration bit of line 10 */
#define EXTI2_FTSR1_FT11_Pos        (11U)
#define EXTI2_FTSR1_FT11_Msk        (0x1UL << EXTI2_FTSR1_FT11_Pos)               /*!< 0x00000800 */
#define EXTI2_FTSR1_FT11            EXTI2_FTSR1_FT11_Msk                         /*!< Falling trigger event configuration bit of line 11 */
#define EXTI2_FTSR1_FT12_Pos        (12U)
#define EXTI2_FTSR1_FT12_Msk        (0x1UL << EXTI2_FTSR1_FT12_Pos)               /*!< 0x00001000 */
#define EXTI2_FTSR1_FT12            EXTI2_FTSR1_FT12_Msk                         /*!< Falling trigger event configuration bit of line 12 */
#define EXTI2_FTSR1_FT13_Pos        (13U)
#define EXTI2_FTSR1_FT13_Msk        (0x1UL << EXTI2_FTSR1_FT13_Pos)               /*!< 0x00002000 */
#define EXTI2_FTSR1_FT13            EXTI2_FTSR1_FT13_Msk                         /*!< Falling trigger event configuration bit of line 13 */
#define EXTI2_FTSR1_FT14_Pos        (14U)
#define EXTI2_FTSR1_FT14_Msk        (0x1UL << EXTI2_FTSR1_FT14_Pos)               /*!< 0x00004000 */
#define EXTI2_FTSR1_FT14            EXTI2_FTSR1_FT14_Msk                         /*!< Falling trigger event configuration bit of line 14 */
#define EXTI2_FTSR1_FT15_Pos        (15U)
#define EXTI2_FTSR1_FT15_Msk        (0x1UL << EXTI2_FTSR1_FT15_Pos)               /*!< 0x00008000 */
#define EXTI2_FTSR1_FT15            EXTI2_FTSR1_FT15_Msk                         /*!< Falling trigger event configuration bit of line 15 */

/******************  Bit definition for EXTI12_SWIER1 register  ******************/
#define EXTI2_SWIER1_SWI0_Pos     (0U)
#define EXTI2_SWIER1_SWI0_Msk     (0x1UL << EXTI2_SWIER1_SWI0_Pos)            /*!< 0x00000001 */
#define EXTI2_SWIER1_SWI0         EXTI2_SWIER1_SWI0_Msk                      /*!< Software Interrupt on line 0 */
#define EXTI2_SWIER1_SWI1_Pos     (1U)
#define EXTI2_SWIER1_SWI1_Msk     (0x1UL << EXTI2_SWIER1_SWI1_Pos)            /*!< 0x00000002 */
#define EXTI2_SWIER1_SWI1         EXTI2_SWIER1_SWI1_Msk                      /*!< Software Interrupt on line 1 */
#define EXTI2_SWIER1_SWI2_Pos     (2U)
#define EXTI2_SWIER1_SWI2_Msk     (0x1UL << EXTI2_SWIER1_SWI2_Pos)            /*!< 0x00000004 */
#define EXTI2_SWIER1_SWI2         EXTI2_SWIER1_SWI2_Msk                      /*!< Software Interrupt on line 2 */
#define EXTI2_SWIER1_SWI3_Pos     (3U)
#define EXTI2_SWIER1_SWI3_Msk     (0x1UL << EXTI2_SWIER1_SWI3_Pos)            /*!< 0x00000008 */
#define EXTI2_SWIER1_SWI3         EXTI2_SWIER1_SWI3_Msk                      /*!< Software Interrupt on line 3 */
#define EXTI2_SWIER1_SWI4_Pos     (4U)
#define EXTI2_SWIER1_SWI4_Msk     (0x1UL << EXTI2_SWIER1_SWI4_Pos)            /*!< 0x00000010 */
#define EXTI2_SWIER1_SWI4         EXTI2_SWIER1_SWI4_Msk                      /*!< Software Interrupt on line 4 */
#define EXTI2_SWIER1_SWI5_Pos     (5U)
#define EXTI2_SWIER1_SWI5_Msk     (0x1UL << EXTI2_SWIER1_SWI5_Pos)            /*!< 0x00000020 */
#define EXTI2_SWIER1_SWI5         EXTI2_SWIER1_SWI5_Msk                      /*!< Software Interrupt on line 5 */
#define EXTI2_SWIER1_SWI6_Pos     (6U)
#define EXTI2_SWIER1_SWI6_Msk     (0x1UL << EXTI2_SWIER1_SWI6_Pos)            /*!< 0x00000040 */
#define EXTI2_SWIER1_SWI6         EXTI2_SWIER1_SWI6_Msk                      /*!< Software Interrupt on line 6 */
#define EXTI2_SWIER1_SWI7_Pos     (7U)
#define EXTI2_SWIER1_SWI7_Msk     (0x1UL << EXTI2_SWIER1_SWI7_Pos)            /*!< 0x00000080 */
#define EXTI2_SWIER1_SWI7         EXTI2_SWIER1_SWI7_Msk                      /*!< Software Interrupt on line 7 */
#define EXTI2_SWIER1_SWI8_Pos     (8U)
#define EXTI2_SWIER1_SWI8_Msk     (0x1UL << EXTI2_SWIER1_SWI8_Pos)            /*!< 0x00000100 */
#define EXTI2_SWIER1_SWI8         EXTI2_SWIER1_SWI8_Msk                      /*!< Software Interrupt on line 8 */
#define EXTI2_SWIER1_SWI9_Pos     (9U)
#define EXTI2_SWIER1_SWI9_Msk     (0x1UL << EXTI2_SWIER1_SWI9_Pos)            /*!< 0x00000200 */
#define EXTI2_SWIER1_SWI9         EXTI2_SWIER1_SWI9_Msk                      /*!< Software Interrupt on line 9 */
#define EXTI2_SWIER1_SWI10_Pos    (10U)
#define EXTI2_SWIER1_SWI10_Msk    (0x1UL << EXTI2_SWIER1_SWI10_Pos)           /*!< 0x00000400 */
#define EXTI2_SWIER1_SWI10        EXTI2_SWIER1_SWI10_Msk                     /*!< Software Interrupt on line 10 */
#define EXTI2_SWIER1_SWI11_Pos    (11U)
#define EXTI2_SWIER1_SWI11_Msk    (0x1UL << EXTI2_SWIER1_SWI11_Pos)           /*!< 0x00000800 */
#define EXTI2_SWIER1_SWI11        EXTI2_SWIER1_SWI11_Msk                     /*!< Software Interrupt on line 11 */
#define EXTI2_SWIER1_SWI12_Pos    (12U)
#define EXTI2_SWIER1_SWI12_Msk    (0x1UL << EXTI2_SWIER1_SWI12_Pos)           /*!< 0x00001000 */
#define EXTI2_SWIER1_SWI12        EXTI2_SWIER1_SWI12_Msk                     /*!< Software Interrupt on line 12 */
#define EXTI2_SWIER1_SWI13_Pos    (13U)
#define EXTI2_SWIER1_SWI13_Msk    (0x1UL << EXTI2_SWIER1_SWI13_Pos)           /*!< 0x00002000 */
#define EXTI2_SWIER1_SWI13        EXTI2_SWIER1_SWI13_Msk                     /*!< Software Interrupt on line 13 */
#define EXTI2_SWIER1_SWI14_Pos    (14U)
#define EXTI2_SWIER1_SWI14_Msk    (0x1UL << EXTI2_SWIER1_SWI14_Pos)           /*!< 0x00004000 */
#define EXTI2_SWIER1_SWI14        EXTI2_SWIER1_SWI14_Msk                     /*!< Software Interrupt on line 14 */
#define EXTI2_SWIER1_SWI15_Pos    (15U)
#define EXTI2_SWIER1_SWI15_Msk    (0x1UL << EXTI2_SWIER1_SWI15_Pos)           /*!< 0x00008000 */
#define EXTI2_SWIER1_SWI15        EXTI2_SWIER1_SWI15_Msk                     /*!< Software Interrupt on line 15 */

/******************  Bit definition for EXTI2_RPR1 register  *******************/
#define EXTI2_RPR1_RPIF0_Pos         (0U)
#define EXTI2_RPR1_RPIF0_Msk         (0x1UL << EXTI2_RPR1_RPIF0_Pos)                /*!< 0x00000001 */
#define EXTI2_RPR1_RPIF0             EXTI2_RPR1_RPIF0_Msk                          /*!< Rising trigger event configuration bit of line 0 */
#define EXTI2_RPR1_RPIF1_Pos         (1U)
#define EXTI2_RPR1_RPIF1_Msk         (0x1UL << EXTI2_RPR1_RPIF1_Pos)                /*!< 0x00000002 */
#define EXTI2_RPR1_RPIF1             EXTI2_RPR1_RPIF1_Msk                          /*!< Rising trigger event configuration bit of line 1 */
#define EXTI2_RPR1_RPIF2_Pos         (2U)
#define EXTI2_RPR1_RPIF2_Msk         (0x1UL << EXTI2_RPR1_RPIF2_Pos)                /*!< 0x00000004 */
#define EXTI2_RPR1_RPIF2             EXTI2_RPR1_RPIF2_Msk                          /*!< Rising trigger event configuration bit of line 2 */
#define EXTI2_RPR1_RPIF3_Pos         (3U)
#define EXTI2_RPR1_RPIF3_Msk         (0x1UL << EXTI2_RPR1_RPIF3_Pos)                /*!< 0x00000008 */
#define EXTI2_RPR1_RPIF3             EXTI2_RPR1_RPIF3_Msk                          /*!< Rising trigger event configuration bit of line 3 */
#define EXTI2_RPR1_RPIF4_Pos         (4U)
#define EXTI2_RPR1_RPIF4_Msk         (0x1UL << EXTI2_RPR1_RPIF4_Pos)                /*!< 0x00000010 */
#define EXTI2_RPR1_RPIF4             EXTI2_RPR1_RPIF4_Msk                          /*!< Rising trigger event configuration bit of line 4 */
#define EXTI2_RPR1_RPIF5_Pos         (5U)
#define EXTI2_RPR1_RPIF5_Msk         (0x1UL << EXTI2_RPR1_RPIF5_Pos)                /*!< 0x00000020 */
#define EXTI2_RPR1_RPIF5             EXTI2_RPR1_RPIF5_Msk                          /*!< Rising trigger event configuration bit of line 5 */
#define EXTI2_RPR1_RPIF6_Pos         (6U)
#define EXTI2_RPR1_RPIF6_Msk         (0x1UL << EXTI2_RPR1_RPIF6_Pos)                /*!< 0x00000040 */
#define EXTI2_RPR1_RPIF6             EXTI2_RPR1_RPIF6_Msk                          /*!< Rising trigger event configuration bit of line 6 */
#define EXTI2_RPR1_RPIF7_Pos         (7U)
#define EXTI2_RPR1_RPIF7_Msk         (0x1UL << EXTI2_RPR1_RPIF7_Pos)                /*!< 0x00000080 */
#define EXTI2_RPR1_RPIF7             EXTI2_RPR1_RPIF7_Msk                          /*!< Rising trigger event configuration bit of line 7 */
#define EXTI2_RPR1_RPIF8_Pos         (8U)
#define EXTI2_RPR1_RPIF8_Msk         (0x1UL << EXTI2_RPR1_RPIF8_Pos)                /*!< 0x00000100 */
#define EXTI2_RPR1_RPIF8             EXTI2_RPR1_RPIF8_Msk                          /*!< Rising trigger event configuration bit of line 8 */
#define EXTI2_RPR1_RPIF9_Pos         (9U)
#define EXTI2_RPR1_RPIF9_Msk         (0x1UL << EXTI2_RPR1_RPIF9_Pos)                /*!< 0x00000200 */
#define EXTI2_RPR1_RPIF9             EXTI2_RPR1_RPIF9_Msk                          /*!< Rising trigger event configuration bit of line 9 */
#define EXTI2_RPR1_RPIF10_Pos        (10U)
#define EXTI2_RPR1_RPIF10_Msk        (0x1UL << EXTI2_RPR1_RPIF10_Pos)               /*!< 0x00000400 */
#define EXTI2_RPR1_RPIF10            EXTI2_RPR1_RPIF10_Msk                         /*!< Rising trigger event configuration bit of line 10 */
#define EXTI2_RPR1_RPIF11_Pos        (11U)
#define EXTI2_RPR1_RPIF11_Msk        (0x1UL << EXTI2_RPR1_RPIF11_Pos)               /*!< 0x00000800 */
#define EXTI2_RPR1_RPIF11            EXTI2_RPR1_RPIF11_Msk                         /*!< Rising trigger event configuration bit of line 11 */
#define EXTI2_RPR1_RPIF12_Pos        (12U)
#define EXTI2_RPR1_RPIF12_Msk        (0x1UL << EXTI2_RPR1_RPIF12_Pos)               /*!< 0x00001000 */
#define EXTI2_RPR1_RPIF12            EXTI2_RPR1_RPIF12_Msk                         /*!< Rising trigger event configuration bit of line 12 */
#define EXTI2_RPR1_RPIF13_Pos        (13U)
#define EXTI2_RPR1_RPIF13_Msk        (0x1UL << EXTI2_RPR1_RPIF13_Pos)               /*!< 0x00002000 */
#define EXTI2_RPR1_RPIF13            EXTI2_RPR1_RPIF13_Msk                         /*!< Rising trigger event configuration bit of line 13 */
#define EXTI2_RPR1_RPIF14_Pos        (14U)
#define EXTI2_RPR1_RPIF14_Msk        (0x1UL << EXTI2_RPR1_RPIF14_Pos)               /*!< 0x00004000 */
#define EXTI2_RPR1_RPIF14            EXTI2_RPR1_RPIF14_Msk                         /*!< Rising trigger event configuration bit of line 14 */
#define EXTI2_RPR1_RPIF15_Pos        (15U)
#define EXTI2_RPR1_RPIF15_Msk        (0x1UL << EXTI2_RPR1_RPIF15_Pos)               /*!< 0x00008000 */
#define EXTI2_RPR1_RPIF15            EXTI2_RPR1_RPIF15_Msk                         /*!< Rising trigger event configuration bit of line 15 */

/******************  Bit definition for EXTI2_FTSR1 register  *******************/
#define EXTI2_FPR1_FPIF0_Pos         (0U)
#define EXTI2_FPR1_FPIF0_Msk         (0x1UL << EXTI2_FPR1_FPIF0_Pos)                /*!< 0x00000001 */
#define EXTI2_FPR1_FPIF0             EXTI2_FPR1_FPIF0_Msk                          /*!< Falling trigger event configuration bit of line 0 */
#define EXTI2_FPR1_FPIF1_Pos         (1U)
#define EXTI2_FPR1_FPIF1_Msk         (0x1UL << EXTI2_FPR1_FPIF1_Pos)                /*!< 0x00000002 */
#define EXTI2_FPR1_FPIF1             EXTI2_FPR1_FPIF1_Msk                          /*!< Falling trigger event configuration bit of line 1 */
#define EXTI2_FPR1_FPIF2_Pos         (2U)
#define EXTI2_FPR1_FPIF2_Msk         (0x1UL << EXTI2_FPR1_FPIF2_Pos)                /*!< 0x00000004 */
#define EXTI2_FPR1_FPIF2             EXTI2_FPR1_FPIF2_Msk                          /*!< Falling trigger event configuration bit of line 2 */
#define EXTI2_FPR1_FPIF3_Pos         (3U)
#define EXTI2_FPR1_FPIF3_Msk         (0x1UL << EXTI2_FPR1_FPIF3_Pos)                /*!< 0x00000008 */
#define EXTI2_FPR1_FPIF3             EXTI2_FPR1_FPIF3_Msk                          /*!< Falling trigger event configuration bit of line 3 */
#define EXTI2_FPR1_FPIF4_Pos         (4U)
#define EXTI2_FPR1_FPIF4_Msk         (0x1UL << EXTI2_FPR1_FPIF4_Pos)                /*!< 0x00000010 */
#define EXTI2_FPR1_FPIF4             EXTI2_FPR1_FPIF4_Msk                          /*!< Falling trigger event configuration bit of line 4 */
#define EXTI2_FPR1_FPIF5_Pos         (5U)
#define EXTI2_FPR1_FPIF5_Msk         (0x1UL << EXTI2_FPR1_FPIF5_Pos)                /*!< 0x00000020 */
#define EXTI2_FPR1_FPIF5             EXTI2_FPR1_FPIF5_Msk                          /*!< Falling trigger event configuration bit of line 5 */
#define EXTI2_FPR1_FPIF6_Pos         (6U)
#define EXTI2_FPR1_FPIF6_Msk         (0x1UL << EXTI2_FPR1_FPIF6_Pos)                /*!< 0x00000040 */
#define EXTI2_FPR1_FPIF6             EXTI2_FPR1_FPIF6_Msk                          /*!< Falling trigger event configuration bit of line 6 */
#define EXTI2_FPR1_FPIF7_Pos         (7U)
#define EXTI2_FPR1_FPIF7_Msk         (0x1UL << EXTI2_FPR1_FPIF7_Pos)                /*!< 0x00000080 */
#define EXTI2_FPR1_FPIF7             EXTI2_FPR1_FPIF7_Msk                          /*!< Falling trigger event configuration bit of line 7 */
#define EXTI2_FPR1_FPIF8_Pos         (8U)
#define EXTI2_FPR1_FPIF8_Msk         (0x1UL << EXTI2_FPR1_FPIF8_Pos)                /*!< 0x00000100 */
#define EXTI2_FPR1_FPIF8             EXTI2_FPR1_FPIF8_Msk                          /*!< Falling trigger event configuration bit of line 8 */
#define EXTI2_FPR1_FPIF9_Pos         (9U)
#define EXTI2_FPR1_FPIF9_Msk         (0x1UL << EXTI2_FPR1_FPIF9_Pos)                /*!< 0x00000200 */
#define EXTI2_FPR1_FPIF9             EXTI2_FPR1_FPIF9_Msk                          /*!< Falling trigger event configuration bit of line 9 */
#define EXTI2_FPR1_FPIF10_Pos        (10U)
#define EXTI2_FPR1_FPIF10_Msk        (0x1UL << EXTI2_FPR1_FPIF10_Pos)               /*!< 0x00000400 */
#define EXTI2_FPR1_FPIF10            EXTI2_FPR1_FPIF10_Msk                         /*!< Falling trigger event configuration bit of line 10 */
#define EXTI2_FPR1_FPIF11_Pos        (11U)
#define EXTI2_FPR1_FPIF11_Msk        (0x1UL << EXTI2_FPR1_FPIF11_Pos)               /*!< 0x00000800 */
#define EXTI2_FPR1_FPIF11            EXTI2_FPR1_FPIF11_Msk                         /*!< Falling trigger event configuration bit of line 11 */
#define EXTI2_FPR1_FPIF12_Pos        (12U)
#define EXTI2_FPR1_FPIF12_Msk        (0x1UL << EXTI2_FPR1_FPIF12_Pos)               /*!< 0x00001000 */
#define EXTI2_FPR1_FPIF12            EXTI2_FPR1_FPIF12_Msk                         /*!< Falling trigger event configuration bit of line 12 */
#define EXTI2_FPR1_FPIF13_Pos        (13U)
#define EXTI2_FPR1_FPIF13_Msk        (0x1UL << EXTI2_FPR1_FPIF13_Pos)               /*!< 0x00002000 */
#define EXTI2_FPR1_FPIF13            EXTI2_FPR1_FPIF13_Msk                         /*!< Falling trigger event configuration bit of line 13 */
#define EXTI2_FPR1_FPIF14_Pos        (14U)
#define EXTI2_FPR1_FPIF14_Msk        (0x1UL << EXTI2_FPR1_FPIF14_Pos)               /*!< 0x00004000 */
#define EXTI2_FPR1_FPIF14            EXTI2_FPR1_FPIF14_Msk                         /*!< Falling trigger event configuration bit of line 14 */
#define EXTI2_FPR1_FPIF15_Pos        (15U)
#define EXTI2_FPR1_FPIF15_Msk        (0x1UL << EXTI2_FPR1_FPIF15_Pos)               /*!< 0x00008000 */
#define EXTI2_FPR1_FPIF15            EXTI2_FPR1_FPIF15_Msk                         /*!< Falling trigger event configuration bit of line 15 */

